cami/Adafruit_nRF52_Arduino/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
# Copyright (c) 2017 Adafruit Industries.  All right reserved.
# Copyright (c) 2019 CAMI&Co. All rights reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.softdevice=Bootloader
menu.debug=Debug

#**********************************************
# CAMI qibanca nectis series on nRF52840
#**********************************************
nectis.name=CAMI qibanca nectis series on nRF52840

# Upload
nectis.bootloader.tool=bootburn
nectis.upload.tool=nrfutil
nectis.upload.protocol=nrfutil
nectis.upload.use_1200bps_touch=true
nectis.upload.wait_for_upload_port=true

# Build
nectis.build.mcu=cortex-m4
nectis.build.f_cpu=64000000
nectis.build.board=NRF52840_NECTIS
nectis.build.core=nRF5
nectis.build.variant=nectis_nRF52840
nectis.build.usb_manufacturer="CAMI and Co."
nectis.build.usb_product="CAMI qibanca nectis series"
nectis.build.extra_flags=-DNRF52840_XXAA -DARDUINO_WIO_LTE_M1NB1_BG96 -DARDUINO_NRF52_FEATHER {build.flags.usb}
nectis.build.ldscript=nrf52840_s140_v6.ld
nectis.build.vid=0x239A
nectis.build.pid=0x8029

# SofDevice Menu
# Ram & ROM size varies depending on SoftDevice (check linker script)
nectis.menu.softdevice.s140v6=0.4.0 (s140 6.1.1)
nectis.menu.softdevice.s140v6.build.sd_flags=-DS140
nectis.menu.softdevice.s140v6.build.sd_name=s140
nectis.menu.softdevice.s140v6.build.sd_version=6.1.1
nectis.menu.softdevice.s140v6.build.sd_fwid=0x00B6
nectis.menu.softdevice.s140v6.build.ldscript=nrf52840_s140_v6.ld
nectis.menu.softdevice.s140v6.upload.maximum_size=815104
nectis.menu.softdevice.s140v6.upload.maximum_data_size=248832

# Debug Menu
nectis.menu.debug.l0=Level 0 (Release)
nectis.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0 -Os
nectis.menu.debug.l1=Level 1 (Error Message)
nectis.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1 -Os
nectis.menu.debug.l2=Level 2 (Full Debug)
nectis.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2 -Os
nectis.menu.debug.l3=Level 3 (Segger SystemView)
nectis.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3 -Os

# DFU Mode with CDC only
nectis.vid.0=0x239A
nectis.pid.0=0x002A
# VID/PID for bootloader with/without UF2, Arduino + Circuitpython App
nectis.vid.0=0x239A
nectis.pid.0=0x8029
# DFU Mode with CDC + MSC (UF2)
nectis.vid.1=0x239A
nectis.pid.1=0x0029
# Arduino Application with CDC + MSC
nectis.vid.2=0x239A
nectis.pid.2=0x8029


# ----------------------------------
# Bluefruit Feather nRF52832
# ----------------------------------
feather52832.name=Adafruit Feather nRF52832
feather52832.bootloader.tool=bootburn

# Upload
feather52832.upload.tool=nrfutil
feather52832.upload.protocol=nrfutil
feather52832.upload.use_1200bps_touch=false
feather52832.upload.wait_for_upload_port=false
feather52832.upload.native_usb=false
feather52832.upload.maximum_size=290816
feather52832.upload.maximum_data_size=52224

# Build
feather52832.build.mcu=cortex-m4
feather52832.build.f_cpu=64000000
feather52832.build.board=NRF52832_FEATHER
feather52832.build.core=nRF5
feather52832.build.variant=feather_nrf52832
feather52840.build.usb_manufacturer="Adafruit LLC"
feather52840.build.usb_product="Feather nRF52832"
feather52832.build.extra_flags=-DNRF52832_XXAA -DNRF52
feather52832.build.ldscript=nrf52832_s132_v6.ld

# SofDevice Menu
feather52832.menu.softdevice.s132v6=0.3.0 SoftDevice s132 6.1.1
feather52832.menu.softdevice.s132v6.build.sd_name=s132
feather52832.menu.softdevice.s132v6.build.sd_version=6.1.1
feather52832.menu.softdevice.s132v6.build.sd_fwid=0x00B7


# ----------------------------------
# Bluefruit Feather nRF52840 Express
# ----------------------------------
feather52840.name=Adafruit Feather nRF52840 Express

# Upload
feather52840.bootloader.tool=bootburn
feather52840.upload.tool=nrfutil
feather52840.upload.protocol=nrfutil
feather52840.upload.use_1200bps_touch=true
feather52840.upload.wait_for_upload_port=true
feather52840.upload.maximum_size=815104
feather52840.upload.maximum_data_size=237568

# Build
feather52840.build.mcu=cortex-m4
feather52840.build.f_cpu=64000000
feather52840.build.board=NRF52840_FEATHER
feather52840.build.core=nRF5
feather52840.build.variant=feather_nrf52840_express
feather52840.build.usb_manufacturer="Adafruit LLC"
feather52840.build.usb_product="Feather nRF52840 Express"
feather52840.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
feather52840.build.ldscript=nrf52840_s140_v6.ld
feather52840.build.vid=0x239A
feather52840.build.pid=0x8029

# SofDevice Menu
feather52840.menu.softdevice.s140v6=0.3.0 SoftDevice s140 6.1.1
feather52840.menu.softdevice.s140v6.build.sd_name=s140
feather52840.menu.softdevice.s140v6.build.sd_version=6.1.1
feather52840.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
feather52840.menu.debug.l0=Level 0 (Release)
feather52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
feather52840.menu.debug.l1=Level 1 (Error Message)
feather52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
feather52840.menu.debug.l2=Level 2 (Full Debug)
feather52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
feather52840.menu.debug.l3=Level 3 (Segger SystemView)
feather52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3


# ----------------------------------
# Feather Bluefruit sense
# ----------------------------------
feather52840sense.name=Adafruit Feather Bluefruit Sense

